SoapAPI/src/test/resources/postAccount.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:api="http://api.soap.it.p.lodz.pl/">
    <soapenv:Header/>
    <soapenv:Body>
        <api:addSingleAccToStorage>
            <!--Optional:-->
            <arg0>
                <!--Optional:-->
                <firstName>Jan</firstName>
                <!--Optional:-->
                <lastName>Testowy</lastName>
                <!--Optional:-->
                <roleOfUser>Admin</roleOfUser>
                <isActive>true</isActive>
                <!--Optional:-->
                <id>testArg0</id>
                <!--Optional:-->
                <login>test123</login>
                <!--Optional:-->
                <password>password</password>
            </arg0>
        </api:addSingleAccToStorage>
    </soapenv:Body>
</soapenv:Envelope>